import React from "react";
import "./FacebookButton.css";

export default function FacebookButton({ onClick }) {
  return (
    <button className="facebook-button" onClick={onClick}>
      <div className="icon-wrapper">
        <svg
          width="14"
          height="14"
          viewBox="0 0 24 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M24 12.0736C24 5.40644 18.6274 0 12 0C5.37258 0 0 5.40644 0 12.0736C0 18.0938 4.388 23.0932 10.125 24V15.5591H7.077V12.0736H10.125V9.41309C10.125 6.39273 11.9168 4.73864 14.6542 4.73864C15.953 4.73864 17.304 4.96618 17.304 4.96618V7.95182H15.8085C14.334 7.95182 13.875 8.92636 13.875 9.93164V12.0736H17.177V15.5591H13.875V24C19.612 23.0932 24 18.0938 24 12.0736Z"
            fill="white"
          />
          <path
            d="M16.875 15.5591L17.177 12.0736H13.875V9.93164C13.875 8.92636 14.334 7.95182 15.8085 7.95182H17.304V4.96618C17.304 4.96618 15.953 4.73864 14.6542 4.73864C11.9168 4.73864 10.125 6.39273 10.125 9.41309V12.0736H7.077V15.5591H10.125V24C10.816 24.1238 11.5267 24.2 12.25 24.2C12.9733 24.2 13.684 24.1238 14.375 24V15.5591H16.875Z"
            fill="#213460"
          />
        </svg>
      </div>
      Увійти за допомогою Facebook
    </button>
  );
}
